#ONE HOT ENCODING USED FOR NOMINAL DATA

In [102]:
#in machine learning wheen you use one-hot encoding then when your have n categories, then you only apply (N-1) COLUMN
#if you not do this then you will face multicollinarity problem

In [103]:
# when you have large number of categories then you apply frequent as categories but less 
#occured to other categories

#1) ONE HOT CODING USING PANDS

In [104]:
import numpy as np
import pandas as pd

In [105]:
import pandas as pd
df=pd.read_csv('cars.csv')

In [106]:
df.head()

     brand  km_driven    fuel         owner  selling_price
0   Maruti     145500  Diesel   First Owner         450000
1    Skoda     120000  Diesel  Second Owner         370000
2    Honda     140000  Petrol   Third Owner         158000
3  Hyundai     127000  Diesel   First Owner         225000
4   Maruti     120000  Petrol   First Owner         130000

In [107]:
df['brand'].value_counts()

brand
Maruti           2448
Hyundai          1415
Mahindra          772
Tata              734
Toyota            488
Honda             467
Ford              397
Chevrolet         230
Renault           228
Volkswagen        186
BMW               120
Skoda             105
Nissan             81
Jaguar             71
Volvo              67
Datsun             65
Mercedes-Benz      54
Fiat               47
Audi               40
Lexus              34
Jeep               31
Mitsubishi         14
Land                6
Force               6
Isuzu               5
Ambassador          4
Kia                 4
MG                  3
Daewoo              3
Ashok               1
Opel                1
Peugeot             1
Name: count, dtype: int64

In [108]:
df['brand'].nunique()

32

In [109]:
df['fuel'].value_counts()

fuel
Diesel    4402
Petrol    3631
CNG         57
LPG         38
Name: count, dtype: int64

In [110]:
df['owner'].value_counts()

owner
First Owner             5289
Second Owner            2105
Third Owner              555
Fourth & Above Owner     174
Test Drive Car             5
Name: count, dtype: int64

1.)OneHotEncoding Using Pandas

In [111]:
pd.get_dummies(df,columns=['fuel','owner'],drop_first=True,dtype=np.int64)

,brand,km_driven,selling_price,fuel_Diesel,fuel_LPG,fuel_Petrol,owner_Fourth & Above Owner,owner_Second Owner,owner_Test Drive Car,owner_Third Owner
0,Maruti,145500,450000,1,0,0,0,0,0,0
1,Skoda,120000,370000,1,0,0,0,1,0,0
2,Honda,140000,158000,0,0,1,0,0,0,1
3,Hyundai,127000,225000,1,0,0,0,0,0,0
4,Maruti,120000,130000,0,0,1,0,0,0,0
...,...,...,...,...,...,...,...,...,...,...
8123,Hyundai,110000,320000,0,0,1,0,0,0,0
8124,Hyundai,119000,135000,1,0,0,1,0,0,0
8125,Maruti,120000,382000,1,0,0,0,0,0,0
8126,Tata,25000,290000,1,0,0,0,0,0,0
8127,Tata,25000,290000,1,0,0,0,0,0,0

#we do not use pandas one hot encoding in machine learning project because it does not learn every thing like when you run next time it may give you another result

In [112]:
# 2)ONE_HOT_ENCODING_USING_SKLEARN

In [113]:
from sklearn.model_selection import train_test_split
x_train,x_test,y_train,y_test=train_test_split(df.iloc[:,0:4],df.iloc[:,-1],test_size=0.2,random_state=2)

In [114]:
df.head()

     brand  km_driven    fuel         owner  selling_price
0   Maruti     145500  Diesel   First Owner         450000
1    Skoda     120000  Diesel  Second Owner         370000
2    Honda     140000  Petrol   Third Owner         158000
3  Hyundai     127000  Diesel   First Owner         225000
4   Maruti     120000  Petrol   First Owner         130000

In [115]:
x_train.head()

         brand  km_driven    fuel         owner
5571   Hyundai      35000  Diesel   First Owner
2038      Jeep      60000  Diesel   First Owner
2957   Hyundai      25000  Petrol   First Owner
7618  Mahindra     130000  Diesel  Second Owner
6684   Hyundai     155000  Diesel   First Owner

In [116]:
x_test.head()

         brand  km_driven    fuel         owner
606    Hyundai      80000  Petrol   First Owner
7575  Mahindra      70000  Diesel  Second Owner
7705    Toyota      68089  Petrol   First Owner
4305   Hyundai      70000  Petrol  Second Owner
2685  Mahindra      97000  Diesel  Second Owner

In [117]:
from sklearn.preprocessing import OneHotEncoder

In [118]:
ohe=OneHotEncoder(drop='first',sparse_output=False)

In [119]:
x_train_new=ohe.fit_transform(x_train[['fuel','owner']])

In [120]:
x_test_new=ohe.fit_transform(x_test[['fuel','owner']])

In [121]:
x_train_new=ohe.fit_transform(x_train[['fuel','owner']])

In [122]:
x_train_new

array([[1., 0., 0., ..., 0., 0., 0.],
       [1., 0., 0., ..., 0., 0., 0.],
       [0., 0., 1., ..., 0., 0., 0.],
       ...,
       [0., 0., 1., ..., 0., 0., 0.],
       [1., 0., 0., ..., 1., 0., 0.],
       [1., 0., 0., ..., 0., 0., 0.]])

In [123]:
x_train_new.shape

(6502, 7)

In [124]:
x_train[['brand','km_driven']].values

array([['Hyundai', 35000],
       ['Jeep', 60000],
       ['Hyundai', 25000],
       ...,
       ['Tata', 15000],
       ['Maruti', 32500],
       ['Isuzu', 121000]], dtype=object)

In [125]:
import numpy as np
np.hstack((x_train[['brand','km_driven']].values,x_train_new))

array([['Hyundai', 35000, 1.0, ..., 0.0, 0.0, 0.0],
       ['Jeep', 60000, 1.0, ..., 0.0, 0.0, 0.0],
       ['Hyundai', 25000, 0.0, ..., 0.0, 0.0, 0.0],
       ...,
       ['Tata', 15000, 0.0, ..., 0.0, 0.0, 0.0],
       ['Maruti', 32500, 1.0, ..., 1.0, 0.0, 0.0],
       ['Isuzu', 121000, 1.0, ..., 0.0, 0.0, 0.0]], dtype=object)

In [126]:
np.hstack((x_train[['brand','km_driven']].values,x_train_new)).shape

(6502, 9)

#3)ONE HOT CODING WITH TOP CATEGORIES

In [127]:
counts=df['brand'].value_counts()

In [128]:
# we are taking threshold that below 100 we will count in other categories

In [129]:
df.nunique()
threshold=100

repl=counts[counts<=threshold].index

In [132]:
import pandas as pd

# Count how many times each brand appears
counts = df['brand'].value_counts()

# Define threshold
threshold = 100  

# Find brands that occur <= threshold times
repl = counts[counts <= threshold].index  

# Replace them with 'uncommon'
df['brand_clean'] = df['brand'].replace(repl, 'uncommon')

# Get one-hot encoded dummies
brand_dummies = pd.get_dummies(df['brand_clean'])

# Example: sample 5 rows
print(brand_dummies.sample(5))

        BMW  Chevrolet   Ford  Honda  Hyundai  Mahindra  Maruti  Renault  \
458   False      False  False  False    False     False   False    False
1503  False      False  False  False    False     False    True    False
5560  False      False  False  False    False     False    True    False
667   False      False  False  False     True     False   False    False
1853  False      False  False  False    False     False   False    False

      Skoda   Tata  Toyota  Volkswagen  uncommon
458   False  False   False       False      True
1503  False  False   False       False     False
5560  False  False   False       False     False
667   False  False   False       False     False
1853  False  False   False       False      True

In [130]:
pd.get_dummies(df['brand'].replace(repl,'uncommon'))

NameError: name 'repl' is not defined

In [131]:
pd.get_dummies(df['brand'].replace(repl,'uncommon')).sample(5)

NameError: name 'repl' is not defined